       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA01.
      ******************************************************************
      * Author: Cleuber Maciel
      * Date:08/07/24
      * Purpose: Learn Cobol
      * Tectonics: cobc
      ******************************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            DISPLAY "BEM VINDO AO PRIMEIRO PROGRAMA EM COBOL"
            DISPLAY  "VAMOS APRENDER?"
            STOP RUN.
       END PROGRAM PROGRAMA01.
